Output from `terraform plan`
```
        }
    }

  # module.ingestion-jobs["visits"].module.glue_archive_job.aws_iam_policy.additional-policy[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional-policy" {
        id               = "arn:aws:iam::972272129531:policy/dpr-archive-visits-preproduction-policy"
        name             = "dpr-archive-visits-preproduction-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObjectAcl",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::dpr-*/*",
                          - "arn:aws:s3:::dpr-*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "logs:AssociateKmsKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:/aws-glue/*"
                    },
                  - {
                      - Action   = [
                          - "sqs:*",
                          - "iam:ListRolePolicies",
                          - "iam:GetRolePolicy",
                          - "iam:GetRole",
                          - "glue:*",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "dms:StopReplicationTask",
                          - "dms:ModifyReplicationTask",
                          - "dms:DescribeTableStatistics",
                          - "dms:DescribeReplicationTasks",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dms:eu-west-2:972272129531:*:*"
                    },
                  - {
                      - Action   = [
                          - "kinesis:SubscribeToShard",
                          - "kinesis:ListShards",
                          - "kinesis:GetShardIterator",
                          - "kinesis:GetRecords",
                          - "kinesis:DescribeStream",
                          - "kinesis:DescribeLimits",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:eu-west-2:972272129531:secret:external/dpr-dps-*",
                          - "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt*",
                          - "kms:DescribeKey",
                          - "kms:Decrypt*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:*:972272129531:key/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Update*",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:Get*",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DescribeStream",
                          - "dynamodb:Delete*",
                          - "dynamodb:CreateTable",
                          - "dynamodb:BatchWrite*",
                          - "dynamodb:BatchGet*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Domain"         = "visits"
            "Jira"           = "DPR2-713"
            "Resource_Type"  = "Glue Job"
            "Service_Bundle" = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_batch_job.data.aws_iam_policy_document.extra-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "extra-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:GetObjectAcl",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::dpr-*",
              + "arn:aws:s3:::dpr-*/*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:AssociateKmsKey",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:*:*:/aws-glue/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
              + "glue:*",
              + "iam:GetRole",
              + "iam:GetRolePolicy",
              + "iam:ListRolePolicies",
              + "sqs:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dms:DescribeReplicationTasks",
              + "dms:DescribeTableStatistics",
              + "dms:ModifyReplicationTask",
              + "dms:StopReplicationTask",
            ]
          + resources = [
              + "arn:aws:dms:eu-west-2:972272129531:*:*",
            ]
        }
      + statement {
          + actions   = [
              + "kinesis:DescribeLimits",
              + "kinesis:DescribeStream",
              + "kinesis:GetRecords",
              + "kinesis:GetShardIterator",
              + "kinesis:ListShards",
              + "kinesis:SubscribeToShard",
            ]
          + resources = [
              + "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-rds-operational-db-secret-SLvlRb",
              + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*",
              + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:external/dpr-dps-*",
            ]
        }
      + statement {
          + actions   = [
              + "kms:Decrypt*",
              + "kms:DescribeKey",
              + "kms:Encrypt*",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "arn:aws:kms:*:972272129531:key/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGet*",
              + "dynamodb:BatchWrite*",
              + "dynamodb:CreateTable",
              + "dynamodb:Delete*",
              + "dynamodb:DescribeStream",
              + "dynamodb:DescribeTable",
              + "dynamodb:Get*",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:Update*",
            ]
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*",
            ]
        }
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_batch_job.aws_iam_policy.additional-policy[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional-policy" {
        id               = "arn:aws:iam::972272129531:policy/dpr-batch-visits-preproduction-policy"
        name             = "dpr-batch-visits-preproduction-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObjectAcl",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::dpr-*/*",
                          - "arn:aws:s3:::dpr-*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "logs:AssociateKmsKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:/aws-glue/*"
                    },
                  - {
                      - Action   = [
                          - "sqs:*",
                          - "iam:ListRolePolicies",
                          - "iam:GetRolePolicy",
                          - "iam:GetRole",
                          - "glue:*",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "dms:StopReplicationTask",
                          - "dms:ModifyReplicationTask",
                          - "dms:DescribeTableStatistics",
                          - "dms:DescribeReplicationTasks",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dms:eu-west-2:972272129531:*:*"
                    },
                  - {
                      - Action   = [
                          - "kinesis:SubscribeToShard",
                          - "kinesis:ListShards",
                          - "kinesis:GetShardIterator",
                          - "kinesis:GetRecords",
                          - "kinesis:DescribeStream",
                          - "kinesis:DescribeLimits",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:eu-west-2:972272129531:secret:external/dpr-dps-*",
                          - "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*",
                          - "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-rds-operational-db-secret-SLvlRb",
                        ]
                    },
                  - {
                      - Action   = [
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt*",
                          - "kms:DescribeKey",
                          - "kms:Decrypt*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:*:972272129531:key/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Update*",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:Get*",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DescribeStream",
                          - "dynamodb:Delete*",
                          - "dynamodb:CreateTable",
                          - "dynamodb:BatchWrite*",
                          - "dynamodb:BatchGet*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Domain"         = "visits"
            "Jira"           = "main"
            "Resource_Type"  = "Glue Job"
            "Service_Bundle" = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.data.aws_iam_policy_document.extra-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "extra-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:GetObjectAcl",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::dpr-*",
              + "arn:aws:s3:::dpr-*/*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:AssociateKmsKey",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:*:*:/aws-glue/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
              + "glue:*",
              + "iam:GetRole",
              + "iam:GetRolePolicy",
              + "iam:ListRolePolicies",
              + "sqs:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dms:DescribeReplicationTasks",
              + "dms:DescribeTableStatistics",
              + "dms:ModifyReplicationTask",
              + "dms:StopReplicationTask",
            ]
          + resources = [
              + "arn:aws:dms:eu-west-2:972272129531:*:*",
            ]
        }
      + statement {
          + actions   = [
              + "kinesis:DescribeLimits",
              + "kinesis:DescribeStream",
              + "kinesis:GetRecords",
              + "kinesis:GetShardIterator",
              + "kinesis:ListShards",
              + "kinesis:SubscribeToShard",
            ]
          + resources = [
              + "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-rds-operational-db-secret-SLvlRb",
              + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*",
              + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:external/dpr-dps-*",
            ]
        }
      + statement {
          + actions   = [
              + "kms:Decrypt*",
              + "kms:DescribeKey",
              + "kms:Encrypt*",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "arn:aws:kms:*:972272129531:key/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGet*",
              + "dynamodb:BatchWrite*",
              + "dynamodb:CreateTable",
              + "dynamodb:Delete*",
              + "dynamodb:DescribeStream",
              + "dynamodb:DescribeTable",
              + "dynamodb:Get*",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:Update*",
            ]
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*",
            ]
        }
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.aws_iam_policy.additional-policy[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional-policy" {
        id               = "arn:aws:iam::972272129531:policy/dpr-cdc-visits-preproduction-policy"
        name             = "dpr-cdc-visits-preproduction-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObjectAcl",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::dpr-*/*",
                          - "arn:aws:s3:::dpr-*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "logs:AssociateKmsKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:/aws-glue/*"
                    },
                  - {
                      - Action   = [
                          - "sqs:*",
                          - "iam:ListRolePolicies",
                          - "iam:GetRolePolicy",
                          - "iam:GetRole",
                          - "glue:*",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "dms:StopReplicationTask",
                          - "dms:ModifyReplicationTask",
                          - "dms:DescribeTableStatistics",
                          - "dms:DescribeReplicationTasks",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dms:eu-west-2:972272129531:*:*"
                    },
                  - {
                      - Action   = [
                          - "kinesis:SubscribeToShard",
                          - "kinesis:ListShards",
                          - "kinesis:GetShardIterator",
                          - "kinesis:GetRecords",
                          - "kinesis:DescribeStream",
                          - "kinesis:DescribeLimits",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:eu-west-2:972272129531:secret:external/dpr-dps-*",
                          - "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*",
                          - "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-rds-operational-db-secret-SLvlRb",
                        ]
                    },
                  - {
                      - Action   = [
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt*",
                          - "kms:DescribeKey",
                          - "kms:Decrypt*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:*:972272129531:key/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Update*",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:Get*",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DescribeStream",
                          - "dynamodb:Delete*",
                          - "dynamodb:CreateTable",
                          - "dynamodb:BatchWrite*",
                          - "dynamodb:BatchGet*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Domain"         = "visits"
            "Jira"           = "main"
            "Resource_Type"  = "Glue Job"
            "Service_Bundle" = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.ingestion-jobs["visits"].module.unprocessed_raw_files_check_job.data.aws_iam_policy_document.extra-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "extra-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:GetObjectAcl",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::dpr-*",
              + "arn:aws:s3:::dpr-*/*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:AssociateKmsKey",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:*:*:/aws-glue/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
              + "glue:*",
              + "iam:GetRole",
              + "iam:GetRolePolicy",
              + "iam:ListRolePolicies",
              + "sqs:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dms:DescribeReplicationTasks",
              + "dms:DescribeTableStatistics",
              + "dms:ModifyReplicationTask",
              + "dms:StopReplicationTask",
            ]
          + resources = [
              + "arn:aws:dms:eu-west-2:972272129531:*:*",
            ]
        }
      + statement {
          + actions   = [
              + "kinesis:DescribeLimits",
              + "kinesis:DescribeStream",
              + "kinesis:GetRecords",
              + "kinesis:GetShardIterator",
              + "kinesis:ListShards",
              + "kinesis:SubscribeToShard",
            ]
          + resources = [
              + "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*",
              + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:external/dpr-dps-*",
            ]
        }
      + statement {
          + actions   = [
              + "kms:Decrypt*",
              + "kms:DescribeKey",
              + "kms:Encrypt*",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "arn:aws:kms:*:972272129531:key/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGet*",
              + "dynamodb:BatchWrite*",
              + "dynamodb:CreateTable",
              + "dynamodb:Delete*",
              + "dynamodb:DescribeStream",
              + "dynamodb:DescribeTable",
              + "dynamodb:Get*",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:Update*",
            ]
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*",
            ]
        }
    }

  # module.ingestion-jobs["visits"].module.unprocessed_raw_files_check_job.aws_iam_policy.additional-policy[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional-policy" {
        id               = "arn:aws:iam::972272129531:policy/pending-files-check-visits-preproduction-policy"
        name             = "pending-files-check-visits-preproduction-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObjectAcl",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::dpr-*/*",
                          - "arn:aws:s3:::dpr-*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "logs:AssociateKmsKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:/aws-glue/*"
                    },
                  - {
                      - Action   = [
                          - "sqs:*",
                          - "iam:ListRolePolicies",
                          - "iam:GetRolePolicy",
                          - "iam:GetRole",
                          - "glue:*",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "dms:StopReplicationTask",
                          - "dms:ModifyReplicationTask",
                          - "dms:DescribeTableStatistics",
                          - "dms:DescribeReplicationTasks",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dms:eu-west-2:972272129531:*:*"
                    },
                  - {
                      - Action   = [
                          - "kinesis:SubscribeToShard",
                          - "kinesis:ListShards",
                          - "kinesis:GetShardIterator",
                          - "kinesis:GetRecords",
                          - "kinesis:DescribeStream",
                          - "kinesis:DescribeLimits",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:eu-west-2:972272129531:secret:external/dpr-dps-*",
                          - "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt*",
                          - "kms:DescribeKey",
                          - "kms:Decrypt*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:*:972272129531:key/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Update*",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:Get*",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DescribeStream",
                          - "dynamodb:Delete*",
                          - "dynamodb:CreateTable",
                          - "dynamodb:BatchWrite*",
                          - "dynamodb:BatchGet*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Domain"         = "visits"
            "Jira"           = "DPR2-713"
            "Resource_Type"  = "Glue Job"
            "Service_Bundle" = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.lambda-setup.module.step_function_notification_lambda.data.aws_iam_policy_document.get_secrets will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "get_secrets" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = []
        }
    }

  # module.lambda-setup.module.step_function_notification_lambda.data.aws_iam_policy_document.lambda_assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.lambda-setup.module.step_function_notification_lambda.data.aws_iam_policy_document.lambda_execution will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_execution" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:eu-west-2:*:*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:AttachNetworkInterface",
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeInstances",
              + "ec2:DescribeNetworkInterfaces",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_iam_policy.lambda_execution[0] will be updated in-place
  ~ resource "aws_iam_policy" "lambda_execution" {
        id               = "arn:aws:iam::972272129531:policy/dpr-pipeline-notification-policy"
        name             = "dpr-pipeline-notification-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:eu-west-2:*:*"
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "cloudwatch:PutMetricData"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DescribeInstances",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                          - "ec2:AttachNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "cloudwatch:PutMetricData"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "dpr-pipeline-notification-role"
        name                  = "dpr-pipeline-notification-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.setup-dms-endpoints["dps-case-notes"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be updated in-place
  ~ resource "aws_dms_endpoint" "dms-s3-target-source" {
        id                              = "dpr-dms-dps-case-notes-pgres-source-endpoint"
        tags                            = {
            "DMS_Source"     = "dps"
            "Domain"         = "Common"
            "Jira"           = "main"
            "Resource_Type"  = "DMS Source Endpoint"
            "Service_Bundle" = "true"
        }
        # (16 unchanged attributes hidden)

      ~ postgres_settings {
          ~ heartbeat_enable             = true -> false
            # (15 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 254 to change, 0 to destroy.

```